benchmark/sglang/old/results/results_1/aggregated/out 128/test2-img-rate1-total5/output.txt
[Tue Jul 21 09:39:26 AM UTC 2026] Waiting for http://aggregation-epp:80/v1/models ...
  Endpoint up.

[Tue Jul 21 09:39:26 AM UTC 2026] === Rate 1 ===
/usr/local/lib/python3.12/dist-packages/torchao/quantization/quant_api.py:1731: SyntaxWarning: invalid escape sequence '\.'
  """Configuration class for applying different quantization configs to modules or parameters based on their fully qualified names (FQNs).
/sgl-workspace/sglang/python/sglang/srt/layers/attention/fla/utils.py:223: UserWarning: Triton is not supported on current platform, roll back to CPU.
  warnings.warn(
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
[transformers] The `use_fast` parameter is deprecated and will be removed in a future version. Use `backend="torchvision"` instead of `use_fast=True`, or `backend="pil"` instead of `use_fast=False`.
benchmark_args=Namespace(backend='sglang-oai-chat', base_url=None, host='aggregation-epp', port=80, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-235B-A22B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=5, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=128, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='blank', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"ignore_eos": true}', apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://aggregation-epp:80/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai-chat', base_url=None, host='aggregation-epp', port=80, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-235B-A22B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=5, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=128, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='blank', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"ignore_eos": true}', apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 10917
#Output tokens: 640
#Total images: 5
#Images per request: 1 (fixed)

=== Token Breakdown (per request avg / total) ===
  Raw text prompt tokens (without overhead): avg=128.0, total=640
  Text prompt tokens (with chat template): avg=141.4, total=707
  Text prompt overhead: avg=13.4, total=67
  Vision tokens: avg=2042.0, total=10210

Created 5 blank jpeg images with average 44379 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 5/5 [00:07<00:00,  1.43s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    1.0       
Max request concurrency:                 not set   
Successful requests:                     5         
Benchmark duration (s):                  7.17      
Total input tokens:                      10917     
Total input text tokens:                 707       
Total input vision tokens:               10210     
Total generated tokens:                  640       
Total generated tokens (retokenized):    640       
Request throughput (req/s):              0.70      
Input token throughput (tok/s):          1523.33   
Output token throughput (tok/s):         89.30     
Peak output token throughput (tok/s):    145.00    
Peak concurrent requests:                2         
Total token throughput (tok/s):          1612.63   
Concurrency:                             1.03      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   1482.59   
Median E2E Latency (ms):                 1502.86   
P90 E2E Latency (ms):                    1535.89   
P95 E2E Latency (ms):                    1545.21   
P99 E2E Latency (ms):                    1552.66   
---------------Time to First Token----------------
Mean TTFT (ms):                          160.65    
Median TTFT (ms):                        159.31    
P90 TTFT (ms):                           169.87    
P95 TTFT (ms):                           170.56    
P99 TTFT (ms):                           171.11    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          10.41     
Median TPOT (ms):                        10.52     
P90 TPOT (ms):                           10.78     
P95 TPOT (ms):                           10.85     
P99 TPOT (ms):                           10.91     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           10.56     
Median ITL (ms):                         9.94      
P90 ITL (ms):                            10.96     
P95 ITL (ms):                            11.51     
P99 ITL (ms):                            21.32     
Max ITL (ms):                            55.86     
==================================================
[Tue Jul 21 09:39:50 AM UTC 2026] Rate 1 done.
[Tue Jul 21 09:39:50 AM UTC 2026] All rates complete.